DataProcessors/СотрудникЦеха.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>СотрудникЦеха</Name>
			<Comment>Сотрудник цеха</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторизованныйСотрудник</Name>
					<Comment>Авторизованный сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпанииСотрудника</Name>
					<Comment>Подразделение компании сотрудника</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпанииТекущегоПользователя</Name>
					<Comment>Подразделение компании текущего пользователя</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийЗаказНаряд</Name>
					<Comment>Текущий заказ-наряд</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущееСостояние</Name>
					<Comment>Текущее состояние</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОтметокВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийДеньНачат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПакет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ФактическоеВремя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ФактическоеВремя</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Comment>Состояние</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОтметокВремени</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Дата окончания</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Продолжительность</Name>
					<Comment>Продолжительность в секундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаОбращения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Comment>Заказ-наряд</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цех</Name>
					<Comment>Цех в котором исполняется авторабота</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Исполнитель выполняющий автоработу</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПакетРабот</Name>
					<Comment>Пакет работ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Цеха.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Цеха</Name>
			<Comment>Цеха компании</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании, к которому относится цех</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Comment>Мастер цеха, подставляемый по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>График работы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИспользованияРабочегоМеста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИспользованияРабочихМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Псевдоним</Name>
					<Comment>Имя используемое для представления в "Записи на ремонт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяВУРВ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦехДляАнализаЭффективности</Name>
					<Comment>Цех для анализа эффективности</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРесурса</Name>
					<Comment>Тип ресурса</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Comment>Цвет в списке планируемых ресурсов</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияОстатковТоваровДоОбособленногоУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/СотрудникЦеха/Forms/ФормаВыбораРабочегоМеста/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("АвторизованныйСотрудник", Объект.АвторизованныйСотрудник);
	Параметры.Свойство("ТекущийЗаказНаряд", Объект.ТекущийЗаказНаряд);
	
	ЗаполнитьТаблицуРабочихМест();
	
	ПереключитьСтраницуНаСервере(1);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыборПоста(Команда)
	
	Идентификатор = Число(СтрЗаменить(Команда.Имя, "ВыборРабочегоМеста", ""));
	
	Строка = РабочиеМеста.НайтиПоИдентификатору(Идентификатор);
	
	Если Строка <> Неопределено Тогда
		Закрыть(Строка.РабочееМесто);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьСтраницу(Команда)
	
	ПереключитьСтраницуНаСервере(?(Команда.Имя = "СтраницаВперед", 1, -1));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УсловноеОформлениеНаСервере()
	
	Элементы.ПереключениеМеждуСтраницами.Видимость = (МаксимальнаяСтраница > 1);
	
	Элементы.СтраницаНазад.Доступность  = (ТекущаяСтраница > 1);
	Элементы.СтраницаВперед.Доступность = (ТекущаяСтраница < МаксимальнаяСтраница);
	
	Элементы.ДекорацияТекущаяСтраница.Заголовок = СтрШаблон("%1 из %2", ТекущаяСтраница, МаксимальнаяСтраница);
	
КонецПроцедуры

// Получение списка доступных рабочих мест
//
&НаСервере
Процедура ЗаполнитьТаблицуРабочихМест()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Цеха.Ссылка КАК РабочееМесто,
	|	Цеха.Родитель КАК Родитель
	|ПОМЕСТИТЬ РабочиеМестаУРВ
	|ИЗ
	|	Справочник.Цеха КАК Цеха
	|ГДЕ
	|	НЕ Цеха.ПометкаУдаления
	|	И Цеха.ИспользуетсяВУРВ
	|	И Цеха.ПодразделениеКомпании В ИЕРАРХИИ(&ПодразделениеСотрудника)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФактическоеВремяСрезПоследних.Цех КАК РабочееМесто,
	|	ФактическоеВремяСрезПоследних.Состояние КАК Состояние
	|ПОМЕСТИТЬ ОтметкиПоЦехам
	|ИЗ
	|	РегистрСведений.ФактическоеВремя.СрезПоследних(
	|			,
	|			Цех В
	|				(ВЫБРАТЬ
	|					РабочиеМестаУРВ.РабочееМесто
	|				ИЗ
	|					РабочиеМестаУРВ КАК РабочиеМестаУРВ)) КАК ФактическоеВремяСрезПоследних
	|ГДЕ
	|	ФактическоеВремяСрезПоследних.Продолжительность = 0
	|	И ФактическоеВремяСрезПоследних.ЗаказНаряд.СводныйРемонтныйЗаказ.Автомобиль <> &Автомобиль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РабочиеМестаУРВ.РабочееМесто КАК РабочееМесто,
	|	РабочиеМестаУРВ.Родитель КАК Родитель
	|ИЗ
	|	РабочиеМестаУРВ КАК РабочиеМестаУРВ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтметкиПоЦехам КАК ОтметкиПоЦехам
	|		ПО РабочиеМестаУРВ.РабочееМесто = ОтметкиПоЦехам.РабочееМесто
	|ГДЕ
	|	ОтметкиПоЦехам.РабочееМесто ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ПодразделениеСотрудника", Объект.АвторизованныйСотрудник.ПодразделениеКомпании);
	// можно выбрать цех, в котором уже ведется работа по выбираемому автомобилю
	Запрос.УстановитьПараметр("Автомобиль", Объект.ТекущийЗаказНаряд.СводныйРемонтныйЗаказ.Автомобиль);
	
	РабочиеМеста.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ИндексСтраницы = 1;
	Сч = 1;
	МаксимумВСтранице = 9;
	Для Каждого РабочееМесто Из РабочиеМеста Цикл
		
		Если Сч > МаксимумВСтранице Тогда
			ИндексСтраницы = ИндексСтраницы + 1;
			Сч = 1;
		КонецЕсли;
		
		РабочееМесто.ИндексСтраницы = ИндексСтраницы;
		
		РабочееМесто.Представление = СтрШаблон(
				"%1%2",
				РабочееМесто.РабочееМесто,
				?(ЗначениеЗаполнено(РабочееМесто.Родитель), СтрШаблон(" (%1)", РабочееМесто.Родитель), ""));
		
		Сч = Сч + 1;
		
	КонецЦикла;
	
	МаксимальнаяСтраница = ИндексСтраницы;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьКомандыВыбора()
	
	// удаляем элементы
	УдаляемыеЭлементы = Новый Массив;
	Для Каждого Элемент Из Элементы.ПерваяСтрока.ПодчиненныеЭлементы Цикл
		УдаляемыеЭлементы.Добавить(Элемент);
	КонецЦикла;
	Для Каждого Элемент Из Элементы.ВтораяСтрока.ПодчиненныеЭлементы Цикл
		УдаляемыеЭлементы.Добавить(Элемент);
	КонецЦикла;
	Для Каждого Элемент Из Элементы.ТретьяСтрока.ПодчиненныеЭлементы Цикл
		УдаляемыеЭлементы.Добавить(Элемент);
	КонецЦикла;
	
	Для Каждого Элемент Из УдаляемыеЭлементы Цикл
		Элементы.Удалить(Элемент);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьКомандыВыбора(ИндексСтраницы)
	
	ОчиститьКомандыВыбора();
	
	КомандыСтраницы = РабочиеМеста.НайтиСтроки(Новый Структура("ИндексСтраницы", ИндексСтраницы));
	Если КомандыСтраницы.Количество() > 0 Тогда
		НомерСтроки = 1; Сч = 0;
		Для Каждого КомандаСтраницы Из КомандыСтраницы Цикл
			Если Сч > 2 Тогда
				НомерСтроки = НомерСтроки + 1; Сч = 0;
				Если НомерСтроки > 3 Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
			
			Если НомерСтроки = 1 Тогда
				Группа = Элементы.ПерваяСтрока;
			ИначеЕсли НомерСтроки = 2 Тогда
				Группа = Элементы.ВтораяСтрока;
			Иначе
				Группа = Элементы.ТретьяСтрока;
			КонецЕсли;
			
			ДобавитьКомандуВыбора(КомандаСтраницы.ПолучитьИдентификатор(), КомандаСтраницы.Представление, Группа);
			
			Сч = Сч + 1;
		КонецЦикла;
	КонецЕсли;
	
	// добавим декорации чтоб форма не прыгала
	Если Элементы.ПерваяСтрока.ПодчиненныеЭлементы.Количество() = 0 Тогда
		НоваяДекорация = Элементы.Добавить("ОтступВПервойСтроке", Тип("ДекорацияФормы"), Элементы.ПерваяСтрока);
		НоваяДекорация.Высота = 3;
		НоваяДекорация.РастягиватьПоВертикали = Истина;
	КонецЕсли;
	
	Если Элементы.ВтораяСтрока.ПодчиненныеЭлементы.Количество() = 0 Тогда
		НоваяДекорация = Элементы.Добавить("ОтступВоВторойСтроке", Тип("ДекорацияФормы"), Элементы.ВтораяСтрока);
		НоваяДекорация.Высота = 3;
		НоваяДекорация.РастягиватьПоВертикали = Истина;
	КонецЕсли;
	
	Если Элементы.ТретьяСтрока.ПодчиненныеЭлементы.Количество() = 0 Тогда
		НоваяДекорация = Элементы.Добавить("ОтступВТретьейСтроке", Тип("ДекорацияФормы"), Элементы.ТретьяСтрока);
		НоваяДекорация.Высота = 3;
		НоваяДекорация.РастягиватьПоВертикали = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьКомандуВыбора(Идентификатор, Представление, Группа)
	
	ИмяКоманды = СтрШаблон("ВыборРабочегоМеста%1", Идентификатор);
	
	НоваяКоманда = Команды.Найти(ИмяКоманды);
	Если НоваяКоманда = Неопределено Тогда
		НоваяКоманда          = Команды.Добавить(ИмяКоманды);
		НоваяКоманда.Действие = "ВыборПоста";
	КонецЕсли;
	
	НоваяКнопка = Элементы.Добавить(СтрШаблон("КнопкаВыборПоста%1", Идентификатор), Тип("КнопкаФормы"), Группа);
	
	НоваяКнопка.Ширина       = 30;
	НоваяКнопка.Высота       = 3;
	НоваяКнопка.Заголовок    = Представление;
	НоваяКнопка.ИмяКоманды   = НоваяКоманда.Имя;
	НоваяКнопка.ЦветФона     = ЦветаСтиля.ЦветФонаШапкиОтчета;
	НоваяКнопка.Шрифт        = Новый Шрифт(ШрифтыСтиля.ОченьКрупныйШрифтТекста,,, Истина);
	
КонецФункции

&НаСервере
Процедура ПереключитьСтраницуНаСервере(Направление)
	
	ТекущаяСтраница = ТекущаяСтраница + Направление;
	СформироватьКомандыВыбора(ТекущаяСтраница);
	
	УсловноеОформлениеНаСервере();
	
КонецПроцедуры

#КонецОбласти
